dart-archive/sdk/src/freertos/stm32f411xe-nucleo/board.c
// Copyright (c) 2016, the Dartino project authors. Please see the AUTHORS file
// for details. All rights reserved. Use of this source code is governed by a
// BSD-style license that can be found in the LICENSE.md file.

#include <string.h>

#include <cmsis_os.h>
#include <stm32f4xx_hal.h>
#include <stm32f4xx_hal_uart.h>

#include "include/static_ffi.h"

#include "src/freertos/device_manager_api.h"
#include "src/freertos/page_alloc.h"

UART_HandleTypeDef huart2;
static UartDriver uart2;

static I2CDriver i2c1;
static I2CDriver i2c2;
static I2CDriver i2c3;

void FillUartDriver(UartDriver* driver);
void FillI2CDriver(I2CDriver* driver, int i2c_no);

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow :
  *            System Clock source            = PLL (HSI)
  *            SYSCLK(Hz)                     = 100000000
  *            HCLK(Hz)                       = 100000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 2
  *            APB2 Prescaler                 = 1
  *            HSI Frequency(Hz)              = 16000000
  *            PLL_M                          = 16
  *            PLL_N                          = 400
  *            PLL_P                          = 4
  *            PLL_Q                          = 7
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale2 mode
  *            Flash Latency(WS)              = 3
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  HAL_StatusTypeDef ret = HAL_OK;

  // Enable Power Control clock.
  __HAL_RCC_PWR_CLK_ENABLE();

  // The voltage scaling allows optimizing the power consumption when
  // the device is clocked below the maximum system frequency, to
  // update the voltage scaling value regarding system frequency refer
  // to product datasheet.
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

  // Enable HSI Oscillator and activate PLL with HSI as source.
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 0x10;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 400;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
  if (ret!= HAL_OK) {
    while (true) ;
  }

  // Select PLL as system clock source and configure the HCLK, PCLK1
  // and PCLK2.  clocks dividers.
  RCC_ClkInitStruct.ClockType =
      (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK |
       RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  ret = HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3);
  if (ret!= HAL_OK) {
    while (true) ;
  }
}

void UART2Init(void)
{
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  HAL_UART_Init(&huart2);
}

void HAL_UART_MspInit(UART_HandleTypeDef* huart)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  if (huart->Instance == USART2) {
    // Peripheral clock enable.
    __USART2_CLK_ENABLE();

    // USART2 GPIO Configuration.
    // PA2     ------> USART2_TX
    // PA3     ------> USART2_RX
    __GPIOA_CLK_ENABLE();
    GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_3;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    HAL_NVIC_SetPriority(USART2_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(USART2_IRQn);
  }
}

void HAL_UART_MspDeInit(UART_HandleTypeDef* huart) {
  if (huart->Instance == USART2) {
    // Peripheral clock disable.
    __USART2_CLK_DISABLE();

    // USART2 GPIO Configuration.
    // PA2     ------> USART2_TX
    // PA3     ------> USART2_RX
    HAL_GPIO_DeInit(GPIOA, GPIO_PIN_2 | GPIO_PIN_3);
  }
}

void SysTick_Handler(void) {
  HAL_IncTick();
  osSystickHandler();
}

extern int InitializeBoard() {
  // Reset of all peripherals, and initialize the Flash interface and
  // the Systick.
  HAL_Init();

  // Configure the system clock. Thie functions is defined in
  // generated/Src/main.c.
  SystemClock_Config();

  // Initialize all configured peripherals.
  UART2Init();

  // Register UART driver for UART2.
  // TODO(542): Registered as "uart1" for now, so it's hooked up to the
  // console. Should be registered as "uart2".
  FillUartDriver(&uart2);
  DeviceManagerRegisterUartDevice("uart1", &uart2);

  // Register I2C drivers. Note: These will be configured on-demand when opened.
  FillI2CDriver(&i2c1, 1);
  FillI2CDriver(&i2c2, 2);
  FillI2CDriver(&i2c3, 3);
  DeviceManagerRegisterI2CDevice("i2c1", &i2c1);
  DeviceManagerRegisterI2CDevice("i2c2", &i2c2);
  DeviceManagerRegisterI2CDevice("i2c3", &i2c3);

  return 0;
}
